app/controllers/admin/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    @users = User.all

INSERT INTO `users` (`email`, `password_digest`, `created_at`, `updated_at`) VALUES ('jrfzidane@yahoo.com', '$2a$10$fuHrf/O/AQQzHd5/re.Up.yDD6uglinNQGOaCuLlwnWia0n9XNrNe', '2015-10-12 08:30:44', '2015-10-12 08:30:44')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

DELETE FROM `users` WHERE `users`.`id` = 3
---
  def destroy
    @user.destroy

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
    def set_user
      @user = User.find(params[:id])