app/views/admin/users/show.html.haml

SELECT `roles`.* FROM `roles` WHERE `roles`.`user_id` = 4
---
  %b Roles
  - if @user.roles.blank?